app/controllers/events_controller.rb

  def show
    @event_data = @event.users_attending(current_user)
    @user_event = current_user ? UserEvent.where(event_id: @event.id, user_id: current_user.id).first : nil
---
SELECT  "user_events".* FROM "user_events" WHERE "user_events"."event_id" = $1 AND "user_events"."user_id" = $2 ORDER BY "user_events"."id" ASC LIMIT $3  [["event_id", 1], ["user_id", 6], ["LIMIT", 1]]
SELECT  "users".* FROM "users" INNER JOIN "user_events" ON "users"."id" = "user_events"."user_id" WHERE "user_events"."event_id" = $1 LIMIT $2  [["event_id", 2], ["LIMIT", 11]]