app/controllers/orders_controller.rb

  def new
    coupon = Coupon.applicable_coupons(current_user)
    fee = Event.where(id: @user_event.event_id).first.fee
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 ORDER BY "events"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @order = Order.new(order_params)
    if @order.save
---
INSERT INTO "orders" ("user_event_id", "amount", "discount", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_event_id", 3], ["amount", 950.0], ["discount", 50.0], ["status", 0], ["created_at", "2020-03-16 15:47:38.820948"], ["updated_at", "2020-03-16 15:47:38.820948"]]