app/controllers/user_events_controller.rb

  def update
    @user_event.update(user_event_params)
---
UPDATE "user_events" SET "status" = $1, "updated_at" = $2 WHERE "user_events"."id" = $3  [["status", 0], ["updated_at", "2020-03-14 13:00:49.420159"], ["id", 1]]

  def create
    @user_event.user = current_user
    @user_event.status = nil
    if @user_event.save
---
INSERT INTO "user_events" ("user_id", "event_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["event_id", 1], ["status", 0], ["created_at", "2020-03-14 17:28:22.360766"], ["updated_at", "2020-03-14 17:28:22.360766"]]