app/models/event.rb

SELECT "user_events".* FROM "user_events" WHERE "user_events"."event_id" = $1 AND (status != 1) AND "user_events"."user_id" != $2  [["event_id", 6], ["user_id", 2]]
SELECT "user_events".* FROM "user_events" WHERE "user_events"."event_id" = $1 AND (status != 1) AND "user_events"."user_id" != $2  [["event_id", 1], ["user_id", 8]]
---
  def users_attending(user)
    event_data = []
    user_event_list = user ? user_events.exclude_unattend.where.not(user_id: user.id) : user_events.exclude_unattend

    user_event_list.each do |user_event|