app/models/order.rb

  def update_user_event_status
    UserEvent.where(id: user_event_id).first.update(status: UserEvent.statuses['attend'])
---
SELECT  "user_events".* FROM "user_events" WHERE "user_events"."id" = $1 ORDER BY "user_events"."id" ASC LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "user_events" SET "status" = $1, "updated_at" = $2 WHERE "user_events"."id" = $3  [["status", 0], ["updated_at", "2020-03-16 13:42:13.099239"], ["id", 8]]